[
  {
    "text": "My giant humidifier saves my skin and breathing every single winter. These filters are the only thing I have to change other then add water and they are perfect. In the past I have had to piece together several other filters to make one large enough to fit and they never were as good. So happy to find these on Amazon. The price is as good as it gets as well. Will buy again and again! Thanks Holmes and Amazon!",
    "label": "Helpful"
  },
  {
    "text": "It is a good .put the heat in my house when needed. And out when not needed.",
    "label": "Very Unhelpful"
  },
  {
    "text": "This item does what it's intended for, and does it moderately well. It allows you to redirect the heat from your dryer into your home instead of the outside in the cold months. Unfortunately, there is a significant design flaw, which makes little sense to me. I'll get into that at the end. First, it's cheap. It's molded plastic that is folded in half to make a tube shape and fit the flapper inside the box. Unfortunately, mine doesn't fold completely and the natural stress in the plastic makes it slightly not circular. This isn't a problem for connecting tubing, but it is a problem for the flapper, as it doesn't seat fully in the outside-flowing tube, so it allows cold air in. Second on the cheap scale are the zip ties it comes with. They are a step up from your standard single-use zip ties, as they have a lever to unlatch and expand them. However, the lever is impossible to push without taking the whole thing off and getting a pair of pliers on both sides of the zip, so it's pointless. Use a standard metal worm clamp instead. The lint trap is useless: Take a stocking or cut off pantyhose and fit it over the end instead of the lint filter, like you probably do on your washer outlet. It's a much better filter. Now to the biggest design flaw, which I can only partially try to explain: There is a hole in the flapper, with a small flimsy inner flapper covering it. The effect is that when the flapper is up, to redirect hot air into your home, much of it is still pushed outside. And when it is in the other position, moving air will pull it open and suck out inside air, and/or push hot air into your home (I'm not sure which, as it's winter now and I don't want to test it right now). My only guess why this inner flapper exists at all is that it is to make up for the poorly closing main flapper, so you don't get stagnant moist air hanging out in the section between the 'heat keeper' and your outside vent. The effect it has is that the heat keeper doesn't fully redirect air, is leaky, and forces you to mount it in one specific orientation, otherwise the inner flapper will hang open and let in outside air. TLDR: It works, but leaks and could be better, and unfortunately there doesn't seem to be a better option made anymore.",
    "label": "Very Helpful"
  },
  {
    "text": "I really like the removable lint screen that comes with the diverter. Makes it easy to clean and helps reduce any lint dust getting into the house. Well worth the money especially during cold winter months.",
    "label": "Helpful"
  },
  {
    "text": "ITS WHAT I WANTED BUT NOT INSTALLED YET",
    "label": "Very Unhelpful"
  },
  {
    "text": "This has been going strong for a few winters now. Really helps heat up the basement on those really cold NJ days.",
    "label": "Helpful"
  },
  {
    "text": "I considered this a starting point. I assumed it would be flimsy based on other reviews but I ordered it anyway. When I got the item, I immediately reinforced it with duct tape, sealing any potential leaks and reinforcing the ring part. I used hard ducting cut to size. The one end fit smoothly into the ducting, and I sealed it well with duct tape. For the other side I had an extra pipe joiner that was almost the perfect size. You can get these at Home Depot for about $6. It includes a rubber grommet that has a butt seal inside, a metal band and 2 integrated hose clamps. The two ends met seamlessly and there are zero air leaks. The unit works great. And we have even run the dryer empty for supplemental heat. Only complaint is the lint catch system could be a little better, but if it was too fine it would probably blocked much of the air flow, as we use a dryer sheet inside the air filter as well. We prefer to just clean a little lint off the floor from time to time for the enhanced heating. If you know what you're doing, this is a great little starting point.\n",
    "label": "Very Helpful"
  },
  {
    "text": "It was what I expected.",
    "label": "Unhelpful"
  },
  {
    "text": "It is a good .put the heat in my house when needed. And out when not needed.\n",
    "label": "Unhelpful"
  },
  {
    "text": "I used to be an unemployed movie theater usher but that all changed when I bought this jacket. Now I’m an unemployed movie theater usher with one of these jackets.\nFred also gave it 5 stars, calling it a Brilliant Product! I was actually given this jacket as a present after having destroyed a death star. I have found that it has given me miraculous powers that i couldn’t have dreamed of! I am able to move objects and even people just by thinking about it! Great for doing chores around the house!",
    "label": "Very Unhelpful"
  },
  {
    "text": "This toy would be a lot more realistic with about 350 people standing in line for an average of an hour. It still makes a nice set with the interrogation room.",
    "label": "Very Unhelpful"
  },
  {
    "text": "What better way to teach the next generation how to behave in a police state then with a toy such as this? Think of all the fun the little folks can have waterboarding those who hate our freedom.",
    "label": "Very Unhelpful"
  },
  {
    "text": "Short, useless comments which do not talk about product functionality.",
    "label": "Very Unhelpful"
  },
  {
    "text": "Short, informative and elucidative comments which showcase product limitations and provide concise feedback.",
    "label": "Helpful"
  },
  {
    "text": "Long, informative and elucidative comments which showcase product limitations and provide detailed feedback.",
    "label": "Very Helpful"
  }
]